GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.h
// Register: CLC4GLS0
#define CLC4GLS0 CLC4GLS0
extern volatile unsigned char           CLC4GLS0            __at(0xE4B);
#ifndef _LIB_BUILD
asm("CLC4GLS0 equ 0E4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1D1N                  :1;
        unsigned G1D1T                  :1;
        unsigned G1D2N                  :1;
        unsigned G1D2T                  :1;
        unsigned G1D3N                  :1;
        unsigned G1D3T                  :1;
        unsigned G1D4N                  :1;
        unsigned G1D4T                  :1;
    };
    struct {
        unsigned LC4G1D1N               :1;
        unsigned LC4G1D1T               :1;
        unsigned LC4G1D2N               :1;
        unsigned LC4G1D2T               :1;
        unsigned LC4G1D3N               :1;
        unsigned LC4G1D3T               :1;
        unsigned LC4G1D4N               :1;
        unsigned LC4G1D4T               :1;
    };
} CLC4GLS0bits_t;
extern volatile CLC4GLS0bits_t CLC4GLS0bits __at(0xE4B);
// bitfield macros
#define _CLC4GLS0_G1D1N_POSN                                0x0
#define _CLC4GLS0_G1D1N_POSITION                            0x0
#define _CLC4GLS0_G1D1N_SIZE                                0x1
#define _CLC4GLS0_G1D1N_LENGTH                              0x1
#define _CLC4GLS0_G1D1N_MASK                                0x1
#define _CLC4GLS0_G1D1T_POSN                                0x1
#define _CLC4GLS0_G1D1T_POSITION                            0x1
#define _CLC4GLS0_G1D1T_SIZE                                0x1
#define _CLC4GLS0_G1D1T_LENGTH                              0x1
#define _CLC4GLS0_G1D1T_MASK                                0x2
#define _CLC4GLS0_G1D2N_POSN                                0x2
#define _CLC4GLS0_G1D2N_POSITION                            0x2
#define _CLC4GLS0_G1D2N_SIZE                                0x1
#define _CLC4GLS0_G1D2N_LENGTH                              0x1
#define _CLC4GLS0_G1D2N_MASK                                0x4
#define _CLC4GLS0_G1D2T_POSN                                0x3
#define _CLC4GLS0_G1D2T_POSITION                            0x3
#define _CLC4GLS0_G1D2T_SIZE                                0x1
#define _CLC4GLS0_G1D2T_LENGTH                              0x1
#define _CLC4GLS0_G1D2T_MASK                                0x8
#define _CLC4GLS0_G1D3N_POSN                                0x4
#define _CLC4GLS0_G1D3N_POSITION                            0x4
#define _CLC4GLS0_G1D3N_SIZE                                0x1
#define _CLC4GLS0_G1D3N_LENGTH                              0x1
#define _CLC4GLS0_G1D3N_MASK                                0x10
#define _CLC4GLS0_G1D3T_POSN                                0x5
#define _CLC4GLS0_G1D3T_POSITION                            0x5
#define _CLC4GLS0_G1D3T_SIZE                                0x1
#define _CLC4GLS0_G1D3T_LENGTH                              0x1
#define _CLC4GLS0_G1D3T_MASK                                0x20
#define _CLC4GLS0_G1D4N_POSN                                0x6
#define _CLC4GLS0_G1D4N_POSITION                            0x6
#define _CLC4GLS0_G1D4N_SIZE                                0x1
#define _CLC4GLS0_G1D4N_LENGTH                              0x1
#define _CLC4GLS0_G1D4N_MASK                                0x40
#define _CLC4GLS0_G1D4T_POSN                                0x7
#define _CLC4GLS0_G1D4T_POSITION                            0x7
#define _CLC4GLS0_G1D4T_SIZE                                0x1
#define _CLC4GLS0_G1D4T_LENGTH                              0x1
#define _CLC4GLS0_G1D4T_MASK                                0x80
#define _CLC4GLS0_LC4G1D1N_POSN                             0x0
#define _CLC4GLS0_LC4G1D1N_POSITION                         0x0
#define _CLC4GLS0_LC4G1D1N_SIZE                             0x1
#define _CLC4GLS0_LC4G1D1N_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D1N_MASK                             0x1
#define _CLC4GLS0_LC4G1D1T_POSN                             0x1
#define _CLC4GLS0_LC4G1D1T_POSITION                         0x1
#define _CLC4GLS0_LC4G1D1T_SIZE                             0x1
#define _CLC4GLS0_LC4G1D1T_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D1T_MASK                             0x2
#define _CLC4GLS0_LC4G1D2N_POSN                             0x2
#define _CLC4GLS0_LC4G1D2N_POSITION                         0x2
#define _CLC4GLS0_LC4G1D2N_SIZE                             0x1
#define _CLC4GLS0_LC4G1D2N_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D2N_MASK                             0x4
#define _CLC4GLS0_LC4G1D2T_POSN                             0x3
#define _CLC4GLS0_LC4G1D2T_POSITION                         0x3
#define _CLC4GLS0_LC4G1D2T_SIZE                             0x1
#define _CLC4GLS0_LC4G1D2T_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D2T_MASK                             0x8
#define _CLC4GLS0_LC4G1D3N_POSN                             0x4
#define _CLC4GLS0_LC4G1D3N_POSITION                         0x4
#define _CLC4GLS0_LC4G1D3N_SIZE                             0x1
#define _CLC4GLS0_LC4G1D3N_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D3N_MASK                             0x10
#define _CLC4GLS0_LC4G1D3T_POSN                             0x5
#define _CLC4GLS0_LC4G1D3T_POSITION                         0x5
#define _CLC4GLS0_LC4G1D3T_SIZE                             0x1
#define _CLC4GLS0_LC4G1D3T_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D3T_MASK                             0x20
#define _CLC4GLS0_LC4G1D4N_POSN                             0x6
#define _CLC4GLS0_LC4G1D4N_POSITION                         0x6
#define _CLC4GLS0_LC4G1D4N_SIZE                             0x1
#define _CLC4GLS0_LC4G1D4N_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D4N_MASK                             0x40
#define _CLC4GLS0_LC4G1D4T_POSN                             0x7
#define _CLC4GLS0_LC4G1D4T_POSITION                         0x7
#define _CLC4GLS0_LC4G1D4T_SIZE                             0x1
#define _CLC4GLS0_LC4G1D4T_LENGTH                           0x1
#define _CLC4GLS0_LC4G1D4T_MASK                             0x80

// Register: CLC4GLS1
#define CLC4GLS1 CLC4GLS1
extern volatile unsigned char           CLC4GLS1            __at(0xE4C);
#ifndef _LIB_BUILD
asm("CLC4GLS1 equ 0E4Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G2D1N                  :1;
        unsigned G2D1T                  :1;
        unsigned G2D2N                  :1;
        unsigned G2D2T                  :1;
        unsigned G2D3N                  :1;
        unsigned G2D3T                  :1;
        unsigned G2D4N                  :1;
        unsigned G2D4T                  :1;
    };
    struct {
        unsigned LC4G2D1N               :1;
        unsigned LC4G2D1T               :1;
        unsigned LC4G2D2N               :1;
        unsigned LC4G2D2T               :1;
        unsigned LC4G2D3N               :1;
        unsigned LC4G2D3T               :1;
        unsigned LC4G2D4N               :1;
        unsigned LC4G2D4T               :1;
    };
} CLC4GLS1bits_t;
