GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.h
// Register: CLC5GLS2
#define CLC5GLS2 CLC5GLS2
extern volatile unsigned char           CLC5GLS2            __at(0xE57);
#ifndef _LIB_BUILD
asm("CLC5GLS2 equ 0E57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G3D1N                  :1;
        unsigned G3D1T                  :1;
        unsigned G3D2N                  :1;
        unsigned G3D2T                  :1;
        unsigned G3D3N                  :1;
        unsigned G3D3T                  :1;
        unsigned G3D4N                  :1;
        unsigned G3D4T                  :1;
    };
    struct {
        unsigned LC5G3D1N               :1;
        unsigned LC5G3D1T               :1;
        unsigned LC5G3D2N               :1;
        unsigned LC5G3D2T               :1;
        unsigned LC5G3D3N               :1;
        unsigned LC5G3D3T               :1;
        unsigned LC5G3D4N               :1;
        unsigned LC5G3D4T               :1;
    };
} CLC5GLS2bits_t;
extern volatile CLC5GLS2bits_t CLC5GLS2bits __at(0xE57);
// bitfield macros
#define _CLC5GLS2_G3D1N_POSN                                0x0
#define _CLC5GLS2_G3D1N_POSITION                            0x0
#define _CLC5GLS2_G3D1N_SIZE                                0x1
#define _CLC5GLS2_G3D1N_LENGTH                              0x1
#define _CLC5GLS2_G3D1N_MASK                                0x1
#define _CLC5GLS2_G3D1T_POSN                                0x1
#define _CLC5GLS2_G3D1T_POSITION                            0x1
#define _CLC5GLS2_G3D1T_SIZE                                0x1
#define _CLC5GLS2_G3D1T_LENGTH                              0x1
#define _CLC5GLS2_G3D1T_MASK                                0x2
#define _CLC5GLS2_G3D2N_POSN                                0x2
#define _CLC5GLS2_G3D2N_POSITION                            0x2
#define _CLC5GLS2_G3D2N_SIZE                                0x1
#define _CLC5GLS2_G3D2N_LENGTH                              0x1
#define _CLC5GLS2_G3D2N_MASK                                0x4
#define _CLC5GLS2_G3D2T_POSN                                0x3
#define _CLC5GLS2_G3D2T_POSITION                            0x3
#define _CLC5GLS2_G3D2T_SIZE                                0x1
#define _CLC5GLS2_G3D2T_LENGTH                              0x1
#define _CLC5GLS2_G3D2T_MASK                                0x8
#define _CLC5GLS2_G3D3N_POSN                                0x4
#define _CLC5GLS2_G3D3N_POSITION                            0x4
#define _CLC5GLS2_G3D3N_SIZE                                0x1
#define _CLC5GLS2_G3D3N_LENGTH                              0x1
#define _CLC5GLS2_G3D3N_MASK                                0x10
#define _CLC5GLS2_G3D3T_POSN                                0x5
#define _CLC5GLS2_G3D3T_POSITION                            0x5
#define _CLC5GLS2_G3D3T_SIZE                                0x1
#define _CLC5GLS2_G3D3T_LENGTH                              0x1
#define _CLC5GLS2_G3D3T_MASK                                0x20
#define _CLC5GLS2_G3D4N_POSN                                0x6
#define _CLC5GLS2_G3D4N_POSITION                            0x6
#define _CLC5GLS2_G3D4N_SIZE                                0x1
#define _CLC5GLS2_G3D4N_LENGTH                              0x1
#define _CLC5GLS2_G3D4N_MASK                                0x40
#define _CLC5GLS2_G3D4T_POSN                                0x7
#define _CLC5GLS2_G3D4T_POSITION                            0x7
#define _CLC5GLS2_G3D4T_SIZE                                0x1
#define _CLC5GLS2_G3D4T_LENGTH                              0x1
#define _CLC5GLS2_G3D4T_MASK                                0x80
#define _CLC5GLS2_LC5G3D1N_POSN                             0x0
#define _CLC5GLS2_LC5G3D1N_POSITION                         0x0
#define _CLC5GLS2_LC5G3D1N_SIZE                             0x1
#define _CLC5GLS2_LC5G3D1N_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D1N_MASK                             0x1
#define _CLC5GLS2_LC5G3D1T_POSN                             0x1
#define _CLC5GLS2_LC5G3D1T_POSITION                         0x1
#define _CLC5GLS2_LC5G3D1T_SIZE                             0x1
#define _CLC5GLS2_LC5G3D1T_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D1T_MASK                             0x2
#define _CLC5GLS2_LC5G3D2N_POSN                             0x2
#define _CLC5GLS2_LC5G3D2N_POSITION                         0x2
#define _CLC5GLS2_LC5G3D2N_SIZE                             0x1
#define _CLC5GLS2_LC5G3D2N_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D2N_MASK                             0x4
#define _CLC5GLS2_LC5G3D2T_POSN                             0x3
#define _CLC5GLS2_LC5G3D2T_POSITION                         0x3
#define _CLC5GLS2_LC5G3D2T_SIZE                             0x1
#define _CLC5GLS2_LC5G3D2T_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D2T_MASK                             0x8
#define _CLC5GLS2_LC5G3D3N_POSN                             0x4
#define _CLC5GLS2_LC5G3D3N_POSITION                         0x4
#define _CLC5GLS2_LC5G3D3N_SIZE                             0x1
#define _CLC5GLS2_LC5G3D3N_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D3N_MASK                             0x10
#define _CLC5GLS2_LC5G3D3T_POSN                             0x5
#define _CLC5GLS2_LC5G3D3T_POSITION                         0x5
#define _CLC5GLS2_LC5G3D3T_SIZE                             0x1
#define _CLC5GLS2_LC5G3D3T_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D3T_MASK                             0x20
#define _CLC5GLS2_LC5G3D4N_POSN                             0x6
#define _CLC5GLS2_LC5G3D4N_POSITION                         0x6
#define _CLC5GLS2_LC5G3D4N_SIZE                             0x1
#define _CLC5GLS2_LC5G3D4N_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D4N_MASK                             0x40
#define _CLC5GLS2_LC5G3D4T_POSN                             0x7
#define _CLC5GLS2_LC5G3D4T_POSITION                         0x7
#define _CLC5GLS2_LC5G3D4T_SIZE                             0x1
#define _CLC5GLS2_LC5G3D4T_LENGTH                           0x1
#define _CLC5GLS2_LC5G3D4T_MASK                             0x80

// Register: CLC5GLS3
#define CLC5GLS3 CLC5GLS3
extern volatile unsigned char           CLC5GLS3            __at(0xE58);
#ifndef _LIB_BUILD
asm("CLC5GLS3 equ 0E58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
    struct {
        unsigned LC5G4D1N               :1;
        unsigned LC5G4D1T               :1;
        unsigned LC5G4D2N               :1;
        unsigned LC5G4D2T               :1;
        unsigned LC5G4D3N               :1;
        unsigned LC5G4D3T               :1;
        unsigned LC5G4D4N               :1;
        unsigned LC5G4D4T               :1;
    };
} CLC5GLS3bits_t;
extern volatile CLC5GLS3bits_t CLC5GLS3bits __at(0xE58);
// bitfield macros
#define _CLC5GLS3_G4D1N_POSN                                0x0
#define _CLC5GLS3_G4D1N_POSITION                            0x0
#define _CLC5GLS3_G4D1N_SIZE                                0x1
#define _CLC5GLS3_G4D1N_LENGTH                              0x1
#define _CLC5GLS3_G4D1N_MASK                                0x1
#define _CLC5GLS3_G4D1T_POSN                                0x1
#define _CLC5GLS3_G4D1T_POSITION                            0x1
#define _CLC5GLS3_G4D1T_SIZE                                0x1
#define _CLC5GLS3_G4D1T_LENGTH                              0x1
#define _CLC5GLS3_G4D1T_MASK                                0x2
#define _CLC5GLS3_G4D2N_POSN                                0x2
#define _CLC5GLS3_G4D2N_POSITION                            0x2
#define _CLC5GLS3_G4D2N_SIZE                                0x1
#define _CLC5GLS3_G4D2N_LENGTH                              0x1
#define _CLC5GLS3_G4D2N_MASK                                0x4
#define _CLC5GLS3_G4D2T_POSN                                0x3
#define _CLC5GLS3_G4D2T_POSITION                            0x3
#define _CLC5GLS3_G4D2T_SIZE                                0x1
#define _CLC5GLS3_G4D2T_LENGTH                              0x1
#define _CLC5GLS3_G4D2T_MASK                                0x8
#define _CLC5GLS3_G4D3N_POSN                                0x4
#define _CLC5GLS3_G4D3N_POSITION                            0x4
#define _CLC5GLS3_G4D3N_SIZE                                0x1
#define _CLC5GLS3_G4D3N_LENGTH                              0x1
#define _CLC5GLS3_G4D3N_MASK                                0x10
#define _CLC5GLS3_G4D3T_POSN                                0x5
#define _CLC5GLS3_G4D3T_POSITION                            0x5
#define _CLC5GLS3_G4D3T_SIZE                                0x1
#define _CLC5GLS3_G4D3T_LENGTH                              0x1
#define _CLC5GLS3_G4D3T_MASK                                0x20
#define _CLC5GLS3_G4D4N_POSN                                0x6
#define _CLC5GLS3_G4D4N_POSITION                            0x6
#define _CLC5GLS3_G4D4N_SIZE                                0x1
#define _CLC5GLS3_G4D4N_LENGTH                              0x1
#define _CLC5GLS3_G4D4N_MASK                                0x40
#define _CLC5GLS3_G4D4T_POSN                                0x7
#define _CLC5GLS3_G4D4T_POSITION                            0x7
#define _CLC5GLS3_G4D4T_SIZE                                0x1
#define _CLC5GLS3_G4D4T_LENGTH                              0x1
#define _CLC5GLS3_G4D4T_MASK                                0x80
#define _CLC5GLS3_LC5G4D1N_POSN                             0x0
#define _CLC5GLS3_LC5G4D1N_POSITION                         0x0
#define _CLC5GLS3_LC5G4D1N_SIZE                             0x1
#define _CLC5GLS3_LC5G4D1N_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D1N_MASK                             0x1
#define _CLC5GLS3_LC5G4D1T_POSN                             0x1
#define _CLC5GLS3_LC5G4D1T_POSITION                         0x1
#define _CLC5GLS3_LC5G4D1T_SIZE                             0x1
#define _CLC5GLS3_LC5G4D1T_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D1T_MASK                             0x2
#define _CLC5GLS3_LC5G4D2N_POSN                             0x2
#define _CLC5GLS3_LC5G4D2N_POSITION                         0x2
#define _CLC5GLS3_LC5G4D2N_SIZE                             0x1
#define _CLC5GLS3_LC5G4D2N_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D2N_MASK                             0x4
#define _CLC5GLS3_LC5G4D2T_POSN                             0x3
#define _CLC5GLS3_LC5G4D2T_POSITION                         0x3
#define _CLC5GLS3_LC5G4D2T_SIZE                             0x1
#define _CLC5GLS3_LC5G4D2T_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D2T_MASK                             0x8
#define _CLC5GLS3_LC5G4D3N_POSN                             0x4
#define _CLC5GLS3_LC5G4D3N_POSITION                         0x4
#define _CLC5GLS3_LC5G4D3N_SIZE                             0x1
#define _CLC5GLS3_LC5G4D3N_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D3N_MASK                             0x10
#define _CLC5GLS3_LC5G4D3T_POSN                             0x5
#define _CLC5GLS3_LC5G4D3T_POSITION                         0x5
#define _CLC5GLS3_LC5G4D3T_SIZE                             0x1
#define _CLC5GLS3_LC5G4D3T_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D3T_MASK                             0x20
#define _CLC5GLS3_LC5G4D4N_POSN                             0x6
#define _CLC5GLS3_LC5G4D4N_POSITION                         0x6
#define _CLC5GLS3_LC5G4D4N_SIZE                             0x1
#define _CLC5GLS3_LC5G4D4N_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D4N_MASK                             0x40
#define _CLC5GLS3_LC5G4D4T_POSN                             0x7
#define _CLC5GLS3_LC5G4D4T_POSITION                         0x7
#define _CLC5GLS3_LC5G4D4T_SIZE                             0x1
#define _CLC5GLS3_LC5G4D4T_LENGTH                           0x1
#define _CLC5GLS3_LC5G4D4T_MASK                             0x80

// Register: CLC6CON
#define CLC6CON CLC6CON
extern volatile unsigned char           CLC6CON             __at(0xE59);
#ifndef _LIB_BUILD
asm("CLC6CON equ 0E59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned LC6MODE                :3;
        unsigned LC6INTN                :1;
        unsigned LC6INTP                :1;
        unsigned LC6OUT                 :1;
        unsigned                        :1;
        unsigned LC6EN                  :1;
    };
    struct {
        unsigned LC6MODE0               :1;
        unsigned LC6MODE1               :1;
        unsigned LC6MODE2               :1;
    };
} CLC6CONbits_t;
extern volatile CLC6CONbits_t CLC6CONbits __at(0xE59);
// bitfield macros
#define _CLC6CON_MODE_POSN                                  0x0
#define _CLC6CON_MODE_POSITION                              0x0
#define _CLC6CON_MODE_SIZE                                  0x3
#define _CLC6CON_MODE_LENGTH                                0x3
#define _CLC6CON_MODE_MASK                                  0x7
#define _CLC6CON_INTN_POSN                                  0x3
#define _CLC6CON_INTN_POSITION                              0x3
#define _CLC6CON_INTN_SIZE                                  0x1
#define _CLC6CON_INTN_LENGTH                                0x1
#define _CLC6CON_INTN_MASK                                  0x8
#define _CLC6CON_INTP_POSN                                  0x4
#define _CLC6CON_INTP_POSITION                              0x4
#define _CLC6CON_INTP_SIZE                                  0x1
#define _CLC6CON_INTP_LENGTH                                0x1
#define _CLC6CON_INTP_MASK                                  0x10
#define _CLC6CON_OUT_POSN                                   0x5
#define _CLC6CON_OUT_POSITION                               0x5
#define _CLC6CON_OUT_SIZE                                   0x1
#define _CLC6CON_OUT_LENGTH                                 0x1
#define _CLC6CON_OUT_MASK                                   0x20
#define _CLC6CON_EN_POSN                                    0x7
#define _CLC6CON_EN_POSITION                                0x7
#define _CLC6CON_EN_SIZE                                    0x1
#define _CLC6CON_EN_LENGTH                                  0x1
#define _CLC6CON_EN_MASK                                    0x80
#define _CLC6CON_MODE0_POSN                                 0x0
#define _CLC6CON_MODE0_POSITION                             0x0
#define _CLC6CON_MODE0_SIZE                                 0x1
#define _CLC6CON_MODE0_LENGTH                               0x1
#define _CLC6CON_MODE0_MASK                                 0x1
#define _CLC6CON_MODE1_POSN                                 0x1
#define _CLC6CON_MODE1_POSITION                             0x1
#define _CLC6CON_MODE1_SIZE                                 0x1
#define _CLC6CON_MODE1_LENGTH                               0x1
#define _CLC6CON_MODE1_MASK                                 0x2
#define _CLC6CON_MODE2_POSN                                 0x2
#define _CLC6CON_MODE2_POSITION                             0x2
#define _CLC6CON_MODE2_SIZE                                 0x1
#define _CLC6CON_MODE2_LENGTH                               0x1
#define _CLC6CON_MODE2_MASK                                 0x4
#define _CLC6CON_LC6MODE_POSN                               0x0
#define _CLC6CON_LC6MODE_POSITION                           0x0
#define _CLC6CON_LC6MODE_SIZE                               0x3
#define _CLC6CON_LC6MODE_LENGTH                             0x3
#define _CLC6CON_LC6MODE_MASK                               0x7
#define _CLC6CON_LC6INTN_POSN                               0x3
#define _CLC6CON_LC6INTN_POSITION                           0x3
#define _CLC6CON_LC6INTN_SIZE                               0x1
#define _CLC6CON_LC6INTN_LENGTH                             0x1
#define _CLC6CON_LC6INTN_MASK                               0x8
#define _CLC6CON_LC6INTP_POSN                               0x4
#define _CLC6CON_LC6INTP_POSITION                           0x4
#define _CLC6CON_LC6INTP_SIZE                               0x1
#define _CLC6CON_LC6INTP_LENGTH                             0x1
#define _CLC6CON_LC6INTP_MASK                               0x10
#define _CLC6CON_LC6OUT_POSN                                0x5
#define _CLC6CON_LC6OUT_POSITION                            0x5
#define _CLC6CON_LC6OUT_SIZE                                0x1
#define _CLC6CON_LC6OUT_LENGTH                              0x1
#define _CLC6CON_LC6OUT_MASK                                0x20
#define _CLC6CON_LC6EN_POSN                                 0x7
#define _CLC6CON_LC6EN_POSITION                             0x7
#define _CLC6CON_LC6EN_SIZE                                 0x1
#define _CLC6CON_LC6EN_LENGTH                               0x1
#define _CLC6CON_LC6EN_MASK                                 0x80
#define _CLC6CON_LC6MODE0_POSN                              0x0
#define _CLC6CON_LC6MODE0_POSITION                          0x0
#define _CLC6CON_LC6MODE0_SIZE                              0x1
#define _CLC6CON_LC6MODE0_LENGTH                            0x1
#define _CLC6CON_LC6MODE0_MASK                              0x1
#define _CLC6CON_LC6MODE1_POSN                              0x1
#define _CLC6CON_LC6MODE1_POSITION                          0x1
#define _CLC6CON_LC6MODE1_SIZE                              0x1
#define _CLC6CON_LC6MODE1_LENGTH                            0x1
#define _CLC6CON_LC6MODE1_MASK                              0x2
#define _CLC6CON_LC6MODE2_POSN                              0x2
#define _CLC6CON_LC6MODE2_POSITION                          0x2
#define _CLC6CON_LC6MODE2_SIZE                              0x1
#define _CLC6CON_LC6MODE2_LENGTH                            0x1
#define _CLC6CON_LC6MODE2_MASK                              0x4

