GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.h
// Register: CLC7GLS0
#define CLC7GLS0 CLC7GLS0
extern volatile unsigned char           CLC7GLS0            __at(0xE69);
#ifndef _LIB_BUILD
asm("CLC7GLS0 equ 0E69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1D1N                  :1;
        unsigned G1D1T                  :1;
        unsigned G1D2N                  :1;
        unsigned G1D2T                  :1;
        unsigned G1D3N                  :1;
        unsigned G1D3T                  :1;
        unsigned G1D4N                  :1;
        unsigned G1D4T                  :1;
    };
    struct {
        unsigned LC7G1D1N               :1;
        unsigned LC7G1D1T               :1;
        unsigned LC7G1D2N               :1;
        unsigned LC7G1D2T               :1;
        unsigned LC7G1D3N               :1;
        unsigned LC7G1D3T               :1;
        unsigned LC7G1D4N               :1;
        unsigned LC7G1D4T               :1;
    };
} CLC7GLS0bits_t;
extern volatile CLC7GLS0bits_t CLC7GLS0bits __at(0xE69);
// bitfield macros
#define _CLC7GLS0_G1D1N_POSN                                0x0
#define _CLC7GLS0_G1D1N_POSITION                            0x0
#define _CLC7GLS0_G1D1N_SIZE                                0x1
#define _CLC7GLS0_G1D1N_LENGTH                              0x1
#define _CLC7GLS0_G1D1N_MASK                                0x1
#define _CLC7GLS0_G1D1T_POSN                                0x1
#define _CLC7GLS0_G1D1T_POSITION                            0x1
#define _CLC7GLS0_G1D1T_SIZE                                0x1
#define _CLC7GLS0_G1D1T_LENGTH                              0x1
#define _CLC7GLS0_G1D1T_MASK                                0x2
#define _CLC7GLS0_G1D2N_POSN                                0x2
#define _CLC7GLS0_G1D2N_POSITION                            0x2
#define _CLC7GLS0_G1D2N_SIZE                                0x1
#define _CLC7GLS0_G1D2N_LENGTH                              0x1
#define _CLC7GLS0_G1D2N_MASK                                0x4
#define _CLC7GLS0_G1D2T_POSN                                0x3
#define _CLC7GLS0_G1D2T_POSITION                            0x3
#define _CLC7GLS0_G1D2T_SIZE                                0x1
#define _CLC7GLS0_G1D2T_LENGTH                              0x1
#define _CLC7GLS0_G1D2T_MASK                                0x8
#define _CLC7GLS0_G1D3N_POSN                                0x4
#define _CLC7GLS0_G1D3N_POSITION                            0x4
#define _CLC7GLS0_G1D3N_SIZE                                0x1
#define _CLC7GLS0_G1D3N_LENGTH                              0x1
#define _CLC7GLS0_G1D3N_MASK                                0x10
#define _CLC7GLS0_G1D3T_POSN                                0x5
#define _CLC7GLS0_G1D3T_POSITION                            0x5
#define _CLC7GLS0_G1D3T_SIZE                                0x1
#define _CLC7GLS0_G1D3T_LENGTH                              0x1
#define _CLC7GLS0_G1D3T_MASK                                0x20
#define _CLC7GLS0_G1D4N_POSN                                0x6
#define _CLC7GLS0_G1D4N_POSITION                            0x6
#define _CLC7GLS0_G1D4N_SIZE                                0x1
#define _CLC7GLS0_G1D4N_LENGTH                              0x1
#define _CLC7GLS0_G1D4N_MASK                                0x40
#define _CLC7GLS0_G1D4T_POSN                                0x7
#define _CLC7GLS0_G1D4T_POSITION                            0x7
#define _CLC7GLS0_G1D4T_SIZE                                0x1
#define _CLC7GLS0_G1D4T_LENGTH                              0x1
#define _CLC7GLS0_G1D4T_MASK                                0x80
#define _CLC7GLS0_LC7G1D1N_POSN                             0x0
#define _CLC7GLS0_LC7G1D1N_POSITION                         0x0
#define _CLC7GLS0_LC7G1D1N_SIZE                             0x1
#define _CLC7GLS0_LC7G1D1N_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D1N_MASK                             0x1
#define _CLC7GLS0_LC7G1D1T_POSN                             0x1
#define _CLC7GLS0_LC7G1D1T_POSITION                         0x1
#define _CLC7GLS0_LC7G1D1T_SIZE                             0x1
#define _CLC7GLS0_LC7G1D1T_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D1T_MASK                             0x2
#define _CLC7GLS0_LC7G1D2N_POSN                             0x2
#define _CLC7GLS0_LC7G1D2N_POSITION                         0x2
#define _CLC7GLS0_LC7G1D2N_SIZE                             0x1
#define _CLC7GLS0_LC7G1D2N_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D2N_MASK                             0x4
#define _CLC7GLS0_LC7G1D2T_POSN                             0x3
#define _CLC7GLS0_LC7G1D2T_POSITION                         0x3
#define _CLC7GLS0_LC7G1D2T_SIZE                             0x1
#define _CLC7GLS0_LC7G1D2T_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D2T_MASK                             0x8
#define _CLC7GLS0_LC7G1D3N_POSN                             0x4
#define _CLC7GLS0_LC7G1D3N_POSITION                         0x4
#define _CLC7GLS0_LC7G1D3N_SIZE                             0x1
#define _CLC7GLS0_LC7G1D3N_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D3N_MASK                             0x10
#define _CLC7GLS0_LC7G1D3T_POSN                             0x5
#define _CLC7GLS0_LC7G1D3T_POSITION                         0x5
#define _CLC7GLS0_LC7G1D3T_SIZE                             0x1
#define _CLC7GLS0_LC7G1D3T_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D3T_MASK                             0x20
#define _CLC7GLS0_LC7G1D4N_POSN                             0x6
#define _CLC7GLS0_LC7G1D4N_POSITION                         0x6
#define _CLC7GLS0_LC7G1D4N_SIZE                             0x1
#define _CLC7GLS0_LC7G1D4N_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D4N_MASK                             0x40
#define _CLC7GLS0_LC7G1D4T_POSN                             0x7
#define _CLC7GLS0_LC7G1D4T_POSITION                         0x7
#define _CLC7GLS0_LC7G1D4T_SIZE                             0x1
#define _CLC7GLS0_LC7G1D4T_LENGTH                           0x1
#define _CLC7GLS0_LC7G1D4T_MASK                             0x80

// Register: CLC7GLS1
#define CLC7GLS1 CLC7GLS1
extern volatile unsigned char           CLC7GLS1            __at(0xE6A);
#ifndef _LIB_BUILD
asm("CLC7GLS1 equ 0E6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G2D1N                  :1;
        unsigned G2D1T                  :1;
        unsigned G2D2N                  :1;
        unsigned G2D2T                  :1;
        unsigned G2D3N                  :1;
        unsigned G2D3T                  :1;
        unsigned G2D4N                  :1;
        unsigned G2D4T                  :1;
    };
    struct {
        unsigned LC7G2D1N               :1;
        unsigned LC7G2D1T               :1;
        unsigned LC7G2D2N               :1;
        unsigned LC7G2D2T               :1;
        unsigned LC7G2D3N               :1;
        unsigned LC7G2D3T               :1;
        unsigned LC7G2D4N               :1;
        unsigned LC7G2D4T               :1;
    };
} CLC7GLS1bits_t;
extern volatile CLC7GLS1bits_t CLC7GLS1bits __at(0xE6A);
// bitfield macros
#define _CLC7GLS1_G2D1N_POSN                                0x0
#define _CLC7GLS1_G2D1N_POSITION                            0x0
#define _CLC7GLS1_G2D1N_SIZE                                0x1
#define _CLC7GLS1_G2D1N_LENGTH                              0x1
#define _CLC7GLS1_G2D1N_MASK                                0x1
#define _CLC7GLS1_G2D1T_POSN                                0x1
#define _CLC7GLS1_G2D1T_POSITION                            0x1
#define _CLC7GLS1_G2D1T_SIZE                                0x1
#define _CLC7GLS1_G2D1T_LENGTH                              0x1
#define _CLC7GLS1_G2D1T_MASK                                0x2
#define _CLC7GLS1_G2D2N_POSN                                0x2
#define _CLC7GLS1_G2D2N_POSITION                            0x2
#define _CLC7GLS1_G2D2N_SIZE                                0x1
#define _CLC7GLS1_G2D2N_LENGTH                              0x1
#define _CLC7GLS1_G2D2N_MASK                                0x4
#define _CLC7GLS1_G2D2T_POSN                                0x3
#define _CLC7GLS1_G2D2T_POSITION                            0x3
#define _CLC7GLS1_G2D2T_SIZE                                0x1
#define _CLC7GLS1_G2D2T_LENGTH                              0x1
#define _CLC7GLS1_G2D2T_MASK                                0x8
#define _CLC7GLS1_G2D3N_POSN                                0x4
#define _CLC7GLS1_G2D3N_POSITION                            0x4
#define _CLC7GLS1_G2D3N_SIZE                                0x1
#define _CLC7GLS1_G2D3N_LENGTH                              0x1
#define _CLC7GLS1_G2D3N_MASK                                0x10
#define _CLC7GLS1_G2D3T_POSN                                0x5
#define _CLC7GLS1_G2D3T_POSITION                            0x5
#define _CLC7GLS1_G2D3T_SIZE                                0x1
#define _CLC7GLS1_G2D3T_LENGTH                              0x1
#define _CLC7GLS1_G2D3T_MASK                                0x20
#define _CLC7GLS1_G2D4N_POSN                                0x6
#define _CLC7GLS1_G2D4N_POSITION                            0x6
#define _CLC7GLS1_G2D4N_SIZE                                0x1
#define _CLC7GLS1_G2D4N_LENGTH                              0x1
#define _CLC7GLS1_G2D4N_MASK                                0x40
#define _CLC7GLS1_G2D4T_POSN                                0x7
#define _CLC7GLS1_G2D4T_POSITION                            0x7
#define _CLC7GLS1_G2D4T_SIZE                                0x1
#define _CLC7GLS1_G2D4T_LENGTH                              0x1
#define _CLC7GLS1_G2D4T_MASK                                0x80
#define _CLC7GLS1_LC7G2D1N_POSN                             0x0
#define _CLC7GLS1_LC7G2D1N_POSITION                         0x0
#define _CLC7GLS1_LC7G2D1N_SIZE                             0x1
#define _CLC7GLS1_LC7G2D1N_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D1N_MASK                             0x1
#define _CLC7GLS1_LC7G2D1T_POSN                             0x1
#define _CLC7GLS1_LC7G2D1T_POSITION                         0x1
#define _CLC7GLS1_LC7G2D1T_SIZE                             0x1
#define _CLC7GLS1_LC7G2D1T_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D1T_MASK                             0x2
#define _CLC7GLS1_LC7G2D2N_POSN                             0x2
#define _CLC7GLS1_LC7G2D2N_POSITION                         0x2
#define _CLC7GLS1_LC7G2D2N_SIZE                             0x1
#define _CLC7GLS1_LC7G2D2N_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D2N_MASK                             0x4
#define _CLC7GLS1_LC7G2D2T_POSN                             0x3
#define _CLC7GLS1_LC7G2D2T_POSITION                         0x3
#define _CLC7GLS1_LC7G2D2T_SIZE                             0x1
#define _CLC7GLS1_LC7G2D2T_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D2T_MASK                             0x8
#define _CLC7GLS1_LC7G2D3N_POSN                             0x4
#define _CLC7GLS1_LC7G2D3N_POSITION                         0x4
#define _CLC7GLS1_LC7G2D3N_SIZE                             0x1
#define _CLC7GLS1_LC7G2D3N_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D3N_MASK                             0x10
#define _CLC7GLS1_LC7G2D3T_POSN                             0x5
#define _CLC7GLS1_LC7G2D3T_POSITION                         0x5
#define _CLC7GLS1_LC7G2D3T_SIZE                             0x1
#define _CLC7GLS1_LC7G2D3T_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D3T_MASK                             0x20
#define _CLC7GLS1_LC7G2D4N_POSN                             0x6
#define _CLC7GLS1_LC7G2D4N_POSITION                         0x6
#define _CLC7GLS1_LC7G2D4N_SIZE                             0x1
#define _CLC7GLS1_LC7G2D4N_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D4N_MASK                             0x40
#define _CLC7GLS1_LC7G2D4T_POSN                             0x7
#define _CLC7GLS1_LC7G2D4T_POSITION                         0x7
#define _CLC7GLS1_LC7G2D4T_SIZE                             0x1
#define _CLC7GLS1_LC7G2D4T_LENGTH                           0x1
#define _CLC7GLS1_LC7G2D4T_MASK                             0x80

