GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.h
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
extern volatile unsigned char           SSP1CLKPPS          __at(0xEB2);
#ifndef _LIB_BUILD
asm("SSP1CLKPPS equ 0EB2h");
#endif
// aliases
extern volatile unsigned char           SSPCLKPPS           __at(0xEB2);
#ifndef _LIB_BUILD
asm("SSPCLKPPS equ 0EB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPCLKPPS0             :1;
        unsigned SSPCLKPPS1             :1;
        unsigned SSPCLKPPS2             :1;
        unsigned SSPCLKPPS3             :1;
        unsigned SSPCLKPPS4             :1;
    };
    struct {
        unsigned SSP1CLKPPS             :5;
    };
    struct {
        unsigned SSP1CLKPPS0            :1;
        unsigned SSP1CLKPPS1            :1;
        unsigned SSP1CLKPPS2            :1;
        unsigned SSP1CLKPPS3            :1;
        unsigned SSP1CLKPPS4            :1;
    };
    struct {
        unsigned SSPCLKPPS              :5;
    };
} SSP1CLKPPSbits_t;
extern volatile SSP1CLKPPSbits_t SSP1CLKPPSbits __at(0xEB2);
// bitfield macros
#define _SSP1CLKPPS_PIN_POSN                                0x0
#define _SSP1CLKPPS_PIN_POSITION                            0x0
#define _SSP1CLKPPS_PIN_SIZE                                0x3
#define _SSP1CLKPPS_PIN_LENGTH                              0x3
#define _SSP1CLKPPS_PIN_MASK                                0x7
#define _SSP1CLKPPS_PORT_POSN                               0x3
#define _SSP1CLKPPS_PORT_POSITION                           0x3
#define _SSP1CLKPPS_PORT_SIZE                               0x2
#define _SSP1CLKPPS_PORT_LENGTH                             0x2
#define _SSP1CLKPPS_PORT_MASK                               0x18
#define _SSP1CLKPPS_SSPCLKPPS0_POSN                         0x0
#define _SSP1CLKPPS_SSPCLKPPS0_POSITION                     0x0
#define _SSP1CLKPPS_SSPCLKPPS0_SIZE                         0x1
#define _SSP1CLKPPS_SSPCLKPPS0_LENGTH                       0x1
#define _SSP1CLKPPS_SSPCLKPPS0_MASK                         0x1
#define _SSP1CLKPPS_SSPCLKPPS1_POSN                         0x1
#define _SSP1CLKPPS_SSPCLKPPS1_POSITION                     0x1
#define _SSP1CLKPPS_SSPCLKPPS1_SIZE                         0x1
#define _SSP1CLKPPS_SSPCLKPPS1_LENGTH                       0x1
#define _SSP1CLKPPS_SSPCLKPPS1_MASK                         0x2
#define _SSP1CLKPPS_SSPCLKPPS2_POSN                         0x2
#define _SSP1CLKPPS_SSPCLKPPS2_POSITION                     0x2
#define _SSP1CLKPPS_SSPCLKPPS2_SIZE                         0x1
#define _SSP1CLKPPS_SSPCLKPPS2_LENGTH                       0x1
#define _SSP1CLKPPS_SSPCLKPPS2_MASK                         0x4
#define _SSP1CLKPPS_SSPCLKPPS3_POSN                         0x3
#define _SSP1CLKPPS_SSPCLKPPS3_POSITION                     0x3
#define _SSP1CLKPPS_SSPCLKPPS3_SIZE                         0x1
#define _SSP1CLKPPS_SSPCLKPPS3_LENGTH                       0x1
#define _SSP1CLKPPS_SSPCLKPPS3_MASK                         0x8
#define _SSP1CLKPPS_SSPCLKPPS4_POSN                         0x4
#define _SSP1CLKPPS_SSPCLKPPS4_POSITION                     0x4
#define _SSP1CLKPPS_SSPCLKPPS4_SIZE                         0x1
#define _SSP1CLKPPS_SSPCLKPPS4_LENGTH                       0x1
#define _SSP1CLKPPS_SSPCLKPPS4_MASK                         0x10
#define _SSP1CLKPPS_SSP1CLKPPS_POSN                         0x0
#define _SSP1CLKPPS_SSP1CLKPPS_POSITION                     0x0
#define _SSP1CLKPPS_SSP1CLKPPS_SIZE                         0x5
#define _SSP1CLKPPS_SSP1CLKPPS_LENGTH                       0x5
#define _SSP1CLKPPS_SSP1CLKPPS_MASK                         0x1F
#define _SSP1CLKPPS_SSP1CLKPPS0_POSN                        0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_POSITION                    0x0
#define _SSP1CLKPPS_SSP1CLKPPS0_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS0_MASK                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSN                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_POSITION                    0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS1_MASK                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSN                        0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_POSITION                    0x2
#define _SSP1CLKPPS_SSP1CLKPPS2_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS2_MASK                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS3_POSN                        0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_POSITION                    0x3
#define _SSP1CLKPPS_SSP1CLKPPS3_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS3_MASK                        0x8
#define _SSP1CLKPPS_SSP1CLKPPS4_POSN                        0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_POSITION                    0x4
#define _SSP1CLKPPS_SSP1CLKPPS4_SIZE                        0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_LENGTH                      0x1
#define _SSP1CLKPPS_SSP1CLKPPS4_MASK                        0x10
#define _SSP1CLKPPS_SSPCLKPPS_POSN                          0x0
#define _SSP1CLKPPS_SSPCLKPPS_POSITION                      0x0
#define _SSP1CLKPPS_SSPCLKPPS_SIZE                          0x5
#define _SSP1CLKPPS_SSPCLKPPS_LENGTH                        0x5
#define _SSP1CLKPPS_SSPCLKPPS_MASK                          0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPCLKPPS0             :1;
        unsigned SSPCLKPPS1             :1;
        unsigned SSPCLKPPS2             :1;
        unsigned SSPCLKPPS3             :1;
        unsigned SSPCLKPPS4             :1;
    };
    struct {
        unsigned SSP1CLKPPS             :5;
    };
    struct {
        unsigned SSP1CLKPPS0            :1;
        unsigned SSP1CLKPPS1            :1;
        unsigned SSP1CLKPPS2            :1;
        unsigned SSP1CLKPPS3            :1;
        unsigned SSP1CLKPPS4            :1;
    };
    struct {
        unsigned SSPCLKPPS              :5;
    };
} SSPCLKPPSbits_t;
