GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.h
// CLC7GLS1<LC7G2D4T>
extern volatile __bit                   LC7G2D4T            __at(0x7357);	// @ (0xE6A * 8 + 7)
#define                                 LC7G2D4T_bit        _BIT_ACCESS(CLC7GLS1,7)
// CLC7POL<LC7G2POL>
extern volatile __bit                   LC7G2POL            __at(0x7321);	// @ (0xE64 * 8 + 1)
#define                                 LC7G2POL_bit        _BIT_ACCESS(CLC7POL,1)
// CLC7GLS2<LC7G3D1N>
extern volatile __bit                   LC7G3D1N            __at(0x7358);	// @ (0xE6B * 8 + 0)
#define                                 LC7G3D1N_bit        _BIT_ACCESS(CLC7GLS2,0)
// CLC7GLS2<LC7G3D1T>
extern volatile __bit                   LC7G3D1T            __at(0x7359);	// @ (0xE6B * 8 + 1)
#define                                 LC7G3D1T_bit        _BIT_ACCESS(CLC7GLS2,1)
// CLC7GLS2<LC7G3D2N>
extern volatile __bit                   LC7G3D2N            __at(0x735A);	// @ (0xE6B * 8 + 2)
#define                                 LC7G3D2N_bit        _BIT_ACCESS(CLC7GLS2,2)
// CLC7GLS2<LC7G3D2T>
extern volatile __bit                   LC7G3D2T            __at(0x735B);	// @ (0xE6B * 8 + 3)
#define                                 LC7G3D2T_bit        _BIT_ACCESS(CLC7GLS2,3)
// CLC7GLS2<LC7G3D3N>
extern volatile __bit                   LC7G3D3N            __at(0x735C);	// @ (0xE6B * 8 + 4)
#define                                 LC7G3D3N_bit        _BIT_ACCESS(CLC7GLS2,4)
// CLC7GLS2<LC7G3D3T>
extern volatile __bit                   LC7G3D3T            __at(0x735D);	// @ (0xE6B * 8 + 5)
#define                                 LC7G3D3T_bit        _BIT_ACCESS(CLC7GLS2,5)
// CLC7GLS2<LC7G3D4N>
extern volatile __bit                   LC7G3D4N            __at(0x735E);	// @ (0xE6B * 8 + 6)
#define                                 LC7G3D4N_bit        _BIT_ACCESS(CLC7GLS2,6)
// CLC7GLS2<LC7G3D4T>
extern volatile __bit                   LC7G3D4T            __at(0x735F);	// @ (0xE6B * 8 + 7)
#define                                 LC7G3D4T_bit        _BIT_ACCESS(CLC7GLS2,7)
// CLC7POL<LC7G3POL>
extern volatile __bit                   LC7G3POL            __at(0x7322);	// @ (0xE64 * 8 + 2)
#define                                 LC7G3POL_bit        _BIT_ACCESS(CLC7POL,2)
// CLC7GLS3<LC7G4D1N>
extern volatile __bit                   LC7G4D1N            __at(0x7360);	// @ (0xE6C * 8 + 0)
#define                                 LC7G4D1N_bit        _BIT_ACCESS(CLC7GLS3,0)
// CLC7GLS3<LC7G4D1T>
extern volatile __bit                   LC7G4D1T            __at(0x7361);	// @ (0xE6C * 8 + 1)
#define                                 LC7G4D1T_bit        _BIT_ACCESS(CLC7GLS3,1)
// CLC7GLS3<LC7G4D2N>
extern volatile __bit                   LC7G4D2N            __at(0x7362);	// @ (0xE6C * 8 + 2)
#define                                 LC7G4D2N_bit        _BIT_ACCESS(CLC7GLS3,2)
// CLC7GLS3<LC7G4D2T>
extern volatile __bit                   LC7G4D2T            __at(0x7363);	// @ (0xE6C * 8 + 3)
#define                                 LC7G4D2T_bit        _BIT_ACCESS(CLC7GLS3,3)
// CLC7GLS3<LC7G4D3N>
extern volatile __bit                   LC7G4D3N            __at(0x7364);	// @ (0xE6C * 8 + 4)
#define                                 LC7G4D3N_bit        _BIT_ACCESS(CLC7GLS3,4)
// CLC7GLS3<LC7G4D3T>
extern volatile __bit                   LC7G4D3T            __at(0x7365);	// @ (0xE6C * 8 + 5)
#define                                 LC7G4D3T_bit        _BIT_ACCESS(CLC7GLS3,5)
// CLC7GLS3<LC7G4D4N>
extern volatile __bit                   LC7G4D4N            __at(0x7366);	// @ (0xE6C * 8 + 6)
#define                                 LC7G4D4N_bit        _BIT_ACCESS(CLC7GLS3,6)
// CLC7GLS3<LC7G4D4T>
extern volatile __bit                   LC7G4D4T            __at(0x7367);	// @ (0xE6C * 8 + 7)
#define                                 LC7G4D4T_bit        _BIT_ACCESS(CLC7GLS3,7)
// CLC7POL<LC7G4POL>
extern volatile __bit                   LC7G4POL            __at(0x7323);	// @ (0xE64 * 8 + 3)
#define                                 LC7G4POL_bit        _BIT_ACCESS(CLC7POL,3)
// CLC7CON<LC7INTN>
extern volatile __bit                   LC7INTN             __at(0x731B);	// @ (0xE63 * 8 + 3)
#define                                 LC7INTN_bit         _BIT_ACCESS(CLC7CON,3)
// CLC7CON<LC7INTP>
extern volatile __bit                   LC7INTP             __at(0x731C);	// @ (0xE63 * 8 + 4)
#define                                 LC7INTP_bit         _BIT_ACCESS(CLC7CON,4)
// CLC7CON<LC7MODE0>
extern volatile __bit                   LC7MODE0            __at(0x7318);	// @ (0xE63 * 8 + 0)
#define                                 LC7MODE0_bit        _BIT_ACCESS(CLC7CON,0)
// CLC7CON<LC7MODE1>
extern volatile __bit                   LC7MODE1            __at(0x7319);	// @ (0xE63 * 8 + 1)
#define                                 LC7MODE1_bit        _BIT_ACCESS(CLC7CON,1)
// CLC7CON<LC7MODE2>
extern volatile __bit                   LC7MODE2            __at(0x731A);	// @ (0xE63 * 8 + 2)
#define                                 LC7MODE2_bit        _BIT_ACCESS(CLC7CON,2)
// CLC7CON<LC7OUT>
extern volatile __bit                   LC7OUT              __at(0x731D);	// @ (0xE63 * 8 + 5)
#define                                 LC7OUT_bit          _BIT_ACCESS(CLC7CON,5)
// CLC7POL<LC7POL>
extern volatile __bit                   LC7POL              __at(0x7327);	// @ (0xE64 * 8 + 7)
#define                                 LC7POL_bit          _BIT_ACCESS(CLC7POL,7)
// CLC8SEL0<LC8D1S0>
extern volatile __bit                   LC8D1S0             __at(0x7378);	// @ (0xE6F * 8 + 0)
#define                                 LC8D1S0_bit         _BIT_ACCESS(CLC8SEL0,0)
// CLC8SEL0<LC8D1S1>
extern volatile __bit                   LC8D1S1             __at(0x7379);	// @ (0xE6F * 8 + 1)
#define                                 LC8D1S1_bit         _BIT_ACCESS(CLC8SEL0,1)
// CLC8SEL0<LC8D1S2>
extern volatile __bit                   LC8D1S2             __at(0x737A);	// @ (0xE6F * 8 + 2)
#define                                 LC8D1S2_bit         _BIT_ACCESS(CLC8SEL0,2)
// CLC8SEL0<LC8D1S3>
extern volatile __bit                   LC8D1S3             __at(0x737B);	// @ (0xE6F * 8 + 3)
#define                                 LC8D1S3_bit         _BIT_ACCESS(CLC8SEL0,3)
// CLC8SEL0<LC8D1S4>
extern volatile __bit                   LC8D1S4             __at(0x737C);	// @ (0xE6F * 8 + 4)
#define                                 LC8D1S4_bit         _BIT_ACCESS(CLC8SEL0,4)
// CLC8SEL0<LC8D1S5>
extern volatile __bit                   LC8D1S5             __at(0x737D);	// @ (0xE6F * 8 + 5)
#define                                 LC8D1S5_bit         _BIT_ACCESS(CLC8SEL0,5)
// CLC8SEL0<LC8D1S6>
extern volatile __bit                   LC8D1S6             __at(0x737E);	// @ (0xE6F * 8 + 6)
#define                                 LC8D1S6_bit         _BIT_ACCESS(CLC8SEL0,6)
// CLC8SEL0<LC8D1S7>
extern volatile __bit                   LC8D1S7             __at(0x737F);	// @ (0xE6F * 8 + 7)
#define                                 LC8D1S7_bit         _BIT_ACCESS(CLC8SEL0,7)
// CLC8SEL1<LC8D2S0>
extern volatile __bit                   LC8D2S0             __at(0x7380);	// @ (0xE70 * 8 + 0)
#define                                 LC8D2S0_bit         _BIT_ACCESS(CLC8SEL1,0)
// CLC8SEL1<LC8D2S1>
extern volatile __bit                   LC8D2S1             __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 LC8D2S1_bit         _BIT_ACCESS(CLC8SEL1,1)
// CLC8SEL1<LC8D2S2>
extern volatile __bit                   LC8D2S2             __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 LC8D2S2_bit         _BIT_ACCESS(CLC8SEL1,2)
// CLC8SEL1<LC8D2S3>
extern volatile __bit                   LC8D2S3             __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 LC8D2S3_bit         _BIT_ACCESS(CLC8SEL1,3)
// CLC8SEL1<LC8D2S4>
extern volatile __bit                   LC8D2S4             __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 LC8D2S4_bit         _BIT_ACCESS(CLC8SEL1,4)
// CLC8SEL1<LC8D2S5>
extern volatile __bit                   LC8D2S5             __at(0x7385);	// @ (0xE70 * 8 + 5)
#define                                 LC8D2S5_bit         _BIT_ACCESS(CLC8SEL1,5)
// CLC8SEL1<LC8D2S6>
extern volatile __bit                   LC8D2S6             __at(0x7386);	// @ (0xE70 * 8 + 6)
#define                                 LC8D2S6_bit         _BIT_ACCESS(CLC8SEL1,6)
// CLC8SEL1<LC8D2S7>
extern volatile __bit                   LC8D2S7             __at(0x7387);	// @ (0xE70 * 8 + 7)
#define                                 LC8D2S7_bit         _BIT_ACCESS(CLC8SEL1,7)
// CLC8SEL2<LC8D3S0>
extern volatile __bit                   LC8D3S0             __at(0x7388);	// @ (0xE71 * 8 + 0)
#define                                 LC8D3S0_bit         _BIT_ACCESS(CLC8SEL2,0)
// CLC8SEL2<LC8D3S1>
extern volatile __bit                   LC8D3S1             __at(0x7389);	// @ (0xE71 * 8 + 1)
#define                                 LC8D3S1_bit         _BIT_ACCESS(CLC8SEL2,1)
// CLC8SEL2<LC8D3S2>
extern volatile __bit                   LC8D3S2             __at(0x738A);	// @ (0xE71 * 8 + 2)
#define                                 LC8D3S2_bit         _BIT_ACCESS(CLC8SEL2,2)
// CLC8SEL2<LC8D3S3>
extern volatile __bit                   LC8D3S3             __at(0x738B);	// @ (0xE71 * 8 + 3)
#define                                 LC8D3S3_bit         _BIT_ACCESS(CLC8SEL2,3)
// CLC8SEL2<LC8D3S4>
extern volatile __bit                   LC8D3S4             __at(0x738C);	// @ (0xE71 * 8 + 4)
#define                                 LC8D3S4_bit         _BIT_ACCESS(CLC8SEL2,4)
// CLC8SEL2<LC8D3S5>
extern volatile __bit                   LC8D3S5             __at(0x738D);	// @ (0xE71 * 8 + 5)
#define                                 LC8D3S5_bit         _BIT_ACCESS(CLC8SEL2,5)
// CLC8SEL2<LC8D3S6>
extern volatile __bit                   LC8D3S6             __at(0x738E);	// @ (0xE71 * 8 + 6)
#define                                 LC8D3S6_bit         _BIT_ACCESS(CLC8SEL2,6)
// CLC8SEL2<LC8D3S7>
extern volatile __bit                   LC8D3S7             __at(0x738F);	// @ (0xE71 * 8 + 7)
#define                                 LC8D3S7_bit         _BIT_ACCESS(CLC8SEL2,7)
// CLC8SEL3<LC8D4S0>
extern volatile __bit                   LC8D4S0             __at(0x7390);	// @ (0xE72 * 8 + 0)
#define                                 LC8D4S0_bit         _BIT_ACCESS(CLC8SEL3,0)
// CLC8SEL3<LC8D4S1>
extern volatile __bit                   LC8D4S1             __at(0x7391);	// @ (0xE72 * 8 + 1)
#define                                 LC8D4S1_bit         _BIT_ACCESS(CLC8SEL3,1)
// CLC8SEL3<LC8D4S2>
extern volatile __bit                   LC8D4S2             __at(0x7392);	// @ (0xE72 * 8 + 2)
#define                                 LC8D4S2_bit         _BIT_ACCESS(CLC8SEL3,2)
// CLC8SEL3<LC8D4S3>
extern volatile __bit                   LC8D4S3             __at(0x7393);	// @ (0xE72 * 8 + 3)
#define                                 LC8D4S3_bit         _BIT_ACCESS(CLC8SEL3,3)
// CLC8SEL3<LC8D4S4>
extern volatile __bit                   LC8D4S4             __at(0x7394);	// @ (0xE72 * 8 + 4)
#define                                 LC8D4S4_bit         _BIT_ACCESS(CLC8SEL3,4)
// CLC8SEL3<LC8D4S5>
extern volatile __bit                   LC8D4S5             __at(0x7395);	// @ (0xE72 * 8 + 5)
#define                                 LC8D4S5_bit         _BIT_ACCESS(CLC8SEL3,5)
// CLC8SEL3<LC8D4S6>
extern volatile __bit                   LC8D4S6             __at(0x7396);	// @ (0xE72 * 8 + 6)
#define                                 LC8D4S6_bit         _BIT_ACCESS(CLC8SEL3,6)
// CLC8SEL3<LC8D4S7>
extern volatile __bit                   LC8D4S7             __at(0x7397);	// @ (0xE72 * 8 + 7)
#define                                 LC8D4S7_bit         _BIT_ACCESS(CLC8SEL3,7)
// CLC8CON<LC8EN>
extern volatile __bit                   LC8EN               __at(0x736F);	// @ (0xE6D * 8 + 7)
#define                                 LC8EN_bit           _BIT_ACCESS(CLC8CON,7)
// CLC8GLS0<LC8G1D1N>
extern volatile __bit                   LC8G1D1N            __at(0x7398);	// @ (0xE73 * 8 + 0)
#define                                 LC8G1D1N_bit        _BIT_ACCESS(CLC8GLS0,0)
// CLC8GLS0<LC8G1D1T>
extern volatile __bit                   LC8G1D1T            __at(0x7399);	// @ (0xE73 * 8 + 1)
#define                                 LC8G1D1T_bit        _BIT_ACCESS(CLC8GLS0,1)
// CLC8GLS0<LC8G1D2N>
extern volatile __bit                   LC8G1D2N            __at(0x739A);	// @ (0xE73 * 8 + 2)
#define                                 LC8G1D2N_bit        _BIT_ACCESS(CLC8GLS0,2)
// CLC8GLS0<LC8G1D2T>
extern volatile __bit                   LC8G1D2T            __at(0x739B);	// @ (0xE73 * 8 + 3)
#define                                 LC8G1D2T_bit        _BIT_ACCESS(CLC8GLS0,3)
// CLC8GLS0<LC8G1D3N>
extern volatile __bit                   LC8G1D3N            __at(0x739C);	// @ (0xE73 * 8 + 4)
#define                                 LC8G1D3N_bit        _BIT_ACCESS(CLC8GLS0,4)
// CLC8GLS0<LC8G1D3T>
extern volatile __bit                   LC8G1D3T            __at(0x739D);	// @ (0xE73 * 8 + 5)
#define                                 LC8G1D3T_bit        _BIT_ACCESS(CLC8GLS0,5)
// CLC8GLS0<LC8G1D4N>
extern volatile __bit                   LC8G1D4N            __at(0x739E);	// @ (0xE73 * 8 + 6)
#define                                 LC8G1D4N_bit        _BIT_ACCESS(CLC8GLS0,6)
// CLC8GLS0<LC8G1D4T>
extern volatile __bit                   LC8G1D4T            __at(0x739F);	// @ (0xE73 * 8 + 7)
#define                                 LC8G1D4T_bit        _BIT_ACCESS(CLC8GLS0,7)
// CLC8POL<LC8G1POL>
extern volatile __bit                   LC8G1POL            __at(0x7370);	// @ (0xE6E * 8 + 0)
#define                                 LC8G1POL_bit        _BIT_ACCESS(CLC8POL,0)
// CLC8GLS1<LC8G2D1N>
extern volatile __bit                   LC8G2D1N            __at(0x73A0);	// @ (0xE74 * 8 + 0)
#define                                 LC8G2D1N_bit        _BIT_ACCESS(CLC8GLS1,0)
// CLC8GLS1<LC8G2D1T>
extern volatile __bit                   LC8G2D1T            __at(0x73A1);	// @ (0xE74 * 8 + 1)
#define                                 LC8G2D1T_bit        _BIT_ACCESS(CLC8GLS1,1)
// CLC8GLS1<LC8G2D2N>
extern volatile __bit                   LC8G2D2N            __at(0x73A2);	// @ (0xE74 * 8 + 2)
#define                                 LC8G2D2N_bit        _BIT_ACCESS(CLC8GLS1,2)
// CLC8GLS1<LC8G2D2T>
extern volatile __bit                   LC8G2D2T            __at(0x73A3);	// @ (0xE74 * 8 + 3)
#define                                 LC8G2D2T_bit        _BIT_ACCESS(CLC8GLS1,3)
// CLC8GLS1<LC8G2D3N>
extern volatile __bit                   LC8G2D3N            __at(0x73A4);	// @ (0xE74 * 8 + 4)
#define                                 LC8G2D3N_bit        _BIT_ACCESS(CLC8GLS1,4)
// CLC8GLS1<LC8G2D3T>
extern volatile __bit                   LC8G2D3T            __at(0x73A5);	// @ (0xE74 * 8 + 5)
#define                                 LC8G2D3T_bit        _BIT_ACCESS(CLC8GLS1,5)
// CLC8GLS1<LC8G2D4N>
extern volatile __bit                   LC8G2D4N            __at(0x73A6);	// @ (0xE74 * 8 + 6)
#define                                 LC8G2D4N_bit        _BIT_ACCESS(CLC8GLS1,6)
// CLC8GLS1<LC8G2D4T>
extern volatile __bit                   LC8G2D4T            __at(0x73A7);	// @ (0xE74 * 8 + 7)
#define                                 LC8G2D4T_bit        _BIT_ACCESS(CLC8GLS1,7)
// CLC8POL<LC8G2POL>
extern volatile __bit                   LC8G2POL            __at(0x7371);	// @ (0xE6E * 8 + 1)
#define                                 LC8G2POL_bit        _BIT_ACCESS(CLC8POL,1)
// CLC8GLS2<LC8G3D1N>
extern volatile __bit                   LC8G3D1N            __at(0x73A8);	// @ (0xE75 * 8 + 0)
#define                                 LC8G3D1N_bit        _BIT_ACCESS(CLC8GLS2,0)
// CLC8GLS2<LC8G3D1T>
extern volatile __bit                   LC8G3D1T            __at(0x73A9);	// @ (0xE75 * 8 + 1)
#define                                 LC8G3D1T_bit        _BIT_ACCESS(CLC8GLS2,1)
// CLC8GLS2<LC8G3D2N>
extern volatile __bit                   LC8G3D2N            __at(0x73AA);	// @ (0xE75 * 8 + 2)
#define                                 LC8G3D2N_bit        _BIT_ACCESS(CLC8GLS2,2)
// CLC8GLS2<LC8G3D2T>
extern volatile __bit                   LC8G3D2T            __at(0x73AB);	// @ (0xE75 * 8 + 3)
#define                                 LC8G3D2T_bit        _BIT_ACCESS(CLC8GLS2,3)
// CLC8GLS2<LC8G3D3N>
extern volatile __bit                   LC8G3D3N            __at(0x73AC);	// @ (0xE75 * 8 + 4)
#define                                 LC8G3D3N_bit        _BIT_ACCESS(CLC8GLS2,4)
// CLC8GLS2<LC8G3D3T>
extern volatile __bit                   LC8G3D3T            __at(0x73AD);	// @ (0xE75 * 8 + 5)
#define                                 LC8G3D3T_bit        _BIT_ACCESS(CLC8GLS2,5)
// CLC8GLS2<LC8G3D4N>
extern volatile __bit                   LC8G3D4N            __at(0x73AE);	// @ (0xE75 * 8 + 6)
#define                                 LC8G3D4N_bit        _BIT_ACCESS(CLC8GLS2,6)
// CLC8GLS2<LC8G3D4T>
extern volatile __bit                   LC8G3D4T            __at(0x73AF);	// @ (0xE75 * 8 + 7)
#define                                 LC8G3D4T_bit        _BIT_ACCESS(CLC8GLS2,7)
// CLC8POL<LC8G3POL>
extern volatile __bit                   LC8G3POL            __at(0x7372);	// @ (0xE6E * 8 + 2)
#define                                 LC8G3POL_bit        _BIT_ACCESS(CLC8POL,2)
// CLC8GLS3<LC8G4D1N>
extern volatile __bit                   LC8G4D1N            __at(0x73B0);	// @ (0xE76 * 8 + 0)
#define                                 LC8G4D1N_bit        _BIT_ACCESS(CLC8GLS3,0)
// CLC8GLS3<LC8G4D1T>
extern volatile __bit                   LC8G4D1T            __at(0x73B1);	// @ (0xE76 * 8 + 1)
#define                                 LC8G4D1T_bit        _BIT_ACCESS(CLC8GLS3,1)
// CLC8GLS3<LC8G4D2N>
extern volatile __bit                   LC8G4D2N            __at(0x73B2);	// @ (0xE76 * 8 + 2)
#define                                 LC8G4D2N_bit        _BIT_ACCESS(CLC8GLS3,2)
// CLC8GLS3<LC8G4D2T>
extern volatile __bit                   LC8G4D2T            __at(0x73B3);	// @ (0xE76 * 8 + 3)
#define                                 LC8G4D2T_bit        _BIT_ACCESS(CLC8GLS3,3)
// CLC8GLS3<LC8G4D3N>
extern volatile __bit                   LC8G4D3N            __at(0x73B4);	// @ (0xE76 * 8 + 4)
#define                                 LC8G4D3N_bit        _BIT_ACCESS(CLC8GLS3,4)
// CLC8GLS3<LC8G4D3T>
extern volatile __bit                   LC8G4D3T            __at(0x73B5);	// @ (0xE76 * 8 + 5)
#define                                 LC8G4D3T_bit        _BIT_ACCESS(CLC8GLS3,5)
// CLC8GLS3<LC8G4D4N>
extern volatile __bit                   LC8G4D4N            __at(0x73B6);	// @ (0xE76 * 8 + 6)
#define                                 LC8G4D4N_bit        _BIT_ACCESS(CLC8GLS3,6)
// CLC8GLS3<LC8G4D4T>
extern volatile __bit                   LC8G4D4T            __at(0x73B7);	// @ (0xE76 * 8 + 7)
#define                                 LC8G4D4T_bit        _BIT_ACCESS(CLC8GLS3,7)
// CLC8POL<LC8G4POL>
extern volatile __bit                   LC8G4POL            __at(0x7373);	// @ (0xE6E * 8 + 3)
#define                                 LC8G4POL_bit        _BIT_ACCESS(CLC8POL,3)
// CLC8CON<LC8INTN>
extern volatile __bit                   LC8INTN             __at(0x736B);	// @ (0xE6D * 8 + 3)
#define                                 LC8INTN_bit         _BIT_ACCESS(CLC8CON,3)
// CLC8CON<LC8INTP>
extern volatile __bit                   LC8INTP             __at(0x736C);	// @ (0xE6D * 8 + 4)
#define                                 LC8INTP_bit         _BIT_ACCESS(CLC8CON,4)
// CLC8CON<LC8MODE0>
extern volatile __bit                   LC8MODE0            __at(0x7368);	// @ (0xE6D * 8 + 0)
#define                                 LC8MODE0_bit        _BIT_ACCESS(CLC8CON,0)
// CLC8CON<LC8MODE1>
extern volatile __bit                   LC8MODE1            __at(0x7369);	// @ (0xE6D * 8 + 1)
#define                                 LC8MODE1_bit        _BIT_ACCESS(CLC8CON,1)
// CLC8CON<LC8MODE2>
extern volatile __bit                   LC8MODE2            __at(0x736A);	// @ (0xE6D * 8 + 2)
#define                                 LC8MODE2_bit        _BIT_ACCESS(CLC8CON,2)
// CLC8CON<LC8OUT>
extern volatile __bit                   LC8OUT              __at(0x736D);	// @ (0xE6D * 8 + 5)
#define                                 LC8OUT_bit          _BIT_ACCESS(CLC8CON,5)
// CLC8POL<LC8POL>
extern volatile __bit                   LC8POL              __at(0x7377);	// @ (0xE6E * 8 + 7)
#define                                 LC8POL_bit          _BIT_ACCESS(CLC8POL,7)
// CWG1CON0<LD>
extern volatile __bit                   LD                  __at(0x79FE);	// @ (0xF3F * 8 + 6)
#define                                 LD_bit              _BIT_ACCESS(CWG1CON0,6)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x76BC);	// @ (0xED7 * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x76B4);	// @ (0xED6 * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// CWG1AS0<LSAC0>
extern volatile __bit                   LSAC0               __at(0x7A0A);	// @ (0xF41 * 8 + 2)
#define                                 LSAC0_bit           _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<LSAC1>
extern volatile __bit                   LSAC1               __at(0x7A0B);	// @ (0xF41 * 8 + 3)
#define                                 LSAC1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSBD0>
extern volatile __bit                   LSBD0               __at(0x7A0C);	// @ (0xF41 * 8 + 4)
#define                                 LSBD0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSBD1>
extern volatile __bit                   LSBD1               __at(0x7A0D);	// @ (0xF41 * 8 + 5)
#define                                 LSBD1_bit           _BIT_ACCESS(CWG1AS0,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x79C0);	// @ (0xF38 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x79C1);	// @ (0xF38 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// CLCDATA<MCL1OUT>
extern volatile __bit                   MCL1OUT             __at(0x73B8);	// @ (0xE77 * 8 + 0)
#define                                 MCL1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// MDCON0<MDBIT>
extern volatile __bit                   MDBIT               __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON0,0)
// MDCARHPPS<MDCARHPPS0>
extern volatile __bit                   MDCARHPPS0          __at(0x7570);	// @ (0xEAE * 8 + 0)
#define                                 MDCARHPPS0_bit      _BIT_ACCESS(MDCARHPPS,0)
// MDCARHPPS<MDCARHPPS1>
extern volatile __bit                   MDCARHPPS1          __at(0x7571);	// @ (0xEAE * 8 + 1)
#define                                 MDCARHPPS1_bit      _BIT_ACCESS(MDCARHPPS,1)
// MDCARHPPS<MDCARHPPS2>
extern volatile __bit                   MDCARHPPS2          __at(0x7572);	// @ (0xEAE * 8 + 2)
#define                                 MDCARHPPS2_bit      _BIT_ACCESS(MDCARHPPS,2)
// MDCARHPPS<MDCARHPPS3>
extern volatile __bit                   MDCARHPPS3          __at(0x7573);	// @ (0xEAE * 8 + 3)
#define                                 MDCARHPPS3_bit      _BIT_ACCESS(MDCARHPPS,3)
// MDCARHPPS<MDCARHPPS4>
extern volatile __bit                   MDCARHPPS4          __at(0x7574);	// @ (0xEAE * 8 + 4)
#define                                 MDCARHPPS4_bit      _BIT_ACCESS(MDCARHPPS,4)
// MDCARLPPS<MDCARLPPS0>
extern volatile __bit                   MDCARLPPS0          __at(0x7568);	// @ (0xEAD * 8 + 0)
#define                                 MDCARLPPS0_bit      _BIT_ACCESS(MDCARLPPS,0)
